{
  "main": {
    "name":"Thanh Lai",
    "occupation":"Software Engineer",
    "description":"My most enduring trait is my curiosity and that shows in my willingness to learn",
    "image":"profilepic.jpg",
    "bio":"My hobbies include watching my beloved Manchester United, taking tranquil hikes, and long directionless strolls. Besides computer science, I like to seek out long meaningful conversations in a range of topics include animals, history, science, politics, and geopolitics. I drink way too much bubble tea and I find myself watching too many dog videos on youtube. I have a notably horrendous track record of judging how long to microwave something and I strongly believe unsolicited pop ups are the root of all evil.",
    "contactmessage":"Lets get coffee or bubble tea!",
    "email": "tlai1122@gmail.com",
    "phone": "(201) 993-8834",
    "address":{
      "city":"New York",
      "state":"New York"
    },
    "website": "https://www.thanh-lai.com",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/thanh1",
        "className":"fa fa-facebook",
        "target": "_blank",
        "color": "#4267B2"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/thanhlai/",
        "className":"fa fa-linkedin",
        "target": "_blank",
        "color": "#0077B5"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/thanhxray/?hl=en",
        "className":"fa fa-instagram",
        "target": "_blank",
        "color": "#DD2A7B"
      },
      {
        "name":"github",
        "url":"https://github.com/Thanh-Lai",
        "className":"fa fa-github",
        "target": "_blank",
        "color": "#FFFFFF"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"Ramapo College of New Jersey",
        "GPA":"GPA: 3.7",
        "graduated":"May 2014",
        "description":"Latin Honors: Magna Cum Laude"
      }
    ],
    "work":[
      {
        "company":"Fluz",
        "techStack":"Full stack developer with a focus on Frontend Web and Mobile development. JavaScript, React, React Native, Redux, Graphql, Sequelize, Postgres, CSS, Redis, Node and more.",
        "positions": [
          {        
            "title":"Lead Engineer",
            "years":"June 2023 - Present",
            "description":[
              "Supervises a team of two engineers that develops a full-stack client-facing mobile and web application.",
              "Supports the team with technical problems, oversees code reviews, debugging, and efficiently onboards new employees.",
              "Mentors and guides junior engineers to promote the development of engineering principles and best practices.",
              "Breaks down complex tasks for projects then assigns tasks and goals to the team."
            ]
          },
          {        
            "title":"Software Engineer",
            "years":"December 2021 - June 2023",
            "description":[
              "Builds new features such as a merchant detail display page that improves visibility and usability.",
              "Delivers modern, highly reusable, and future-proof frontend components as such swipe-able card decks and carousels.",
              "Realizes designs and animations that enhance user experience, usability, and visual aesthetics.",
              "Writes migration scripts using knex to update and maintain the database to achieve business goals.",
              "Creates and maintains GraphQL schemas, queries, mutations, and fragments using Apollo Client.",
              "Implemented functionalities for a new virtual debit card product that offers cash back.",
              "Reskined a large portion of the app and rewrite queries to improve user-friendliness, load speed, and responsivedesign.",
              "Built a service to delete tokens of unused user bank cards from VGS, a data security vendor, to save the companytens of thousands of dollars."
            ]
          }
        ]
      },
      {
        "company":"FreedomCare",
        "techStack" : "",
        "positions" : [
          {
            "title":"Home Care Aide",
            "years":"December 2020 - November 2021",
            "description":["CDPAP home care aid to my father managing his home dialysis treatment."]
          }
        ]
      },
      {
        "company":"Guidepoint",
        "techStack":"Full stack developer utilizing LAMP stack (Linux, Azure, MySQL, PHP), JavaScript, jQuery, CSS, Redis, and more.",
        "positions" : [
          {
            "title":"Software Engineer",
            "years":"September 2019 - October 2020",
            "description":[
              "Developed new features and maintained the company’s Customer Relationship Management system.",
              "Implemented a rating and tagging system that allowed for more strategic and accurate use of data.",
              "Built data-driven report dashboards to provide the business with key data to make informed decisions.",
              "Handled client-side and server-side validations to improve security and data handling.",
              "Documented workflow and projects with detailed information to improve organization and collective knowledge."
            ]
          }
        ] 
      },
      {
        "company":"JETSWEAT",
        "techStack":"Full stack developer utilizing JavaScript, React, Redux, MySQL, CSS, and more.",
        "positions" : [
          {
            "title":"Software Development Intern",
            "years":"June 2019 - August 2019",
            "description":[
              "Developed new user-facing features such as a calendar dashboard and workout scheduling.",
              "Designed and built REST APIs to integrate new features and allow for safe transfer of data between client andserver using microservice architecture.",
              "Overhauled the Redux store to allow for better management of data throughout the application."
            ]
          }
        ]
      }
    ],
    "skillmessage":"Eager to learn and passionate to grow",
    "skills":[
      {
        "name":"JavaScript",
        "level":"98%"
      },
      {
        "name":"PHP",
        "level":"50%"
      },
      {
        "name":"Python",
        "level":"50%"
      },
      {
        "name":"React",
        "level":"92%"
      },
      {
        "name":"React Native",
        "level":"90%"
      },
      {
        "name":"HTML5",
        "level":"100%"
      },
      {
        "name":"CSS",
        "level":"95%"
      },
      {
        "name":"SQL",
        "level":"82%"
      },
      {
        "name":"Redux",
        "level":"90%"
      },
      {
        "name":"Graphql",
        "level":"85%"
      },
      {
        "name":"Sequelize",
        "level":"90%"
      },
      {
        "name":"Node",
        "level":"75%"
      },
      {
        "name":"Express",
        "level":"85%"
      },
      {
        "name":"AWS",
        "level":"75%"
      }
    ]
  },
  "portfolio":{	
    "projects": [	
        {
            "title":"Play Sudoku",
            "category":"A sudoku player with all the features needed to enjoy the game. Dedicated to Maki Kaji (Oct 8, 1951 - Aug 10, 2021)",
            "image":"sudoku.jpg",	
            "url":"https://play-sudoku-08102021.herokuapp.com/",
            "gitHub": "https://github.com/Thanh-Lai/sudoku-game"
          },
      {
        "title":"ThanhBot",
        "category":"AI chatbot that answers interview questions and tells jokes",
        "image":"thanhbot.jpg",	
        "url":"https://www.thanh-lai.com",
        "gitHub": "https://github.com/Thanh-Lai/portfolio"
      },
      {
        "title":"Lyrics Player",
        "category":"Music platform for searching songs based on lyrics",
        "image":"lyricsplayer.jpg",	
        "url":"https://lyricsplayer.tk",
        "gitHub": "https://github.com/Thanh-Lai/lyrics-player"	
      },
      {
        "title":"Leggo-my-Lego",
        "category":"Breakout style Phaser game (Please be patient with load-time)",
        "image":"leggo-eggo.jpg",
        "url":"http://www.leggo-my-lego.com",
        "gitHub": "https://github.com/Thanh-Lai/Stackathon-Leggo-my-Lego"
      }
    ]
  },
  "quotes":{
    "quotes":[
      {
        "text":"You Are Never Too Old To Set Another Goal Or To Dream A New Dream.",
        "user":"C.S. Lewis"
      },
      {
        "text":"A person who never made a mistake never tried anything new.",
        "user":"Albert Einstein"
      },
      {
        "text":"Nothing can stop a person with the right mental attitude from achieving his goal; nothing on earth can help a person with the wrong mental attitude.",
        "user":"Thomas Jefferson"
      }
    ]
  }
}
